app/Controllers/AdminController.php

SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'customer'
SELECT COUNT(*) AS `numrows` FROM `menu_items`
---
    public function dashboard()
    {
        $session = session();

        // Ensure only admin can access dashboard
        if ($session->get('role') !== 'admin') {
            return redirect()->to('/dashboard');
        }

        $userModel = new UserModel();
        $menuModel = new MenuItemModel();

        // Load dashboard summary: total customers + total menu items
        $data = [
            'totalUsers' => $userModel->where('role', 'customer')->countAllResults(),
            'totalMenu'  => $menuModel->countAll(),
        ];

SELECT *
FROM `users`
WHERE `role` = 'customer'
 LIMIT 8
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'customer'
---
    public function users()
    {
        $session = session();

        // Restrict access to admin only
        if ($session->get('role') !== 'admin') {
            return redirect()->to('/dashboard');
        }

        $userModel = new UserModel();

        // Retrieve customer accounts with pagination
        $data['users'] = $userModel
            ->where('role', 'customer')
            ->paginate(8);