app/Controllers/AdminMenuController.php

    public function index()
    {
        $category = $this->request->getGet('category');

        // Build query sorted by ID
        $query = $this->menuModel->orderBy('id', 'ASC');

        // Apply category filter only if selected
        if (!empty($category)) {
            $query->where('category', $category);
        }

        // Pagination: 7 items per page
        $data['menu_items']       = $query->paginate(7);
---
SELECT *
FROM `menu_items`
WHERE `category` = 'coffee-beverages'
ORDER BY `id` ASC
 LIMIT 7
SELECT COUNT(*) AS `numrows`
FROM `menu_items`
WHERE `category` = 'coffee-beverages'