app/Controllers/LoginController.php

SELECT *
FROM `users`
WHERE `email` = 'admin@coffee.email'
 LIMIT 1
---
    public function auth()
    {
        // Start / get session
        $session   = session();
        $userModel = new UserModel();

        // Get form inputs
        $email    = $this->request->getVar('email');
        $password = $this->request->getVar('password');

        // Fetch user record by email
        $user = $userModel->where('email', $email)->first();