app/Controllers/ProfileController.php

SELECT *
FROM `users`
WHERE `users`.`id` = '20'
---
    public function index()
    {
        $session   = session();
        $userModel = new UserModel();

        // Get logged-in user ID from session (set in LoginController)
        $userId = $session->get('user_id');

        // If no user ID in session, force login
        if (!$userId) {
            return redirect()->to('/login')->with('error', 'Please login first.');
        }

        // Fetch user record from database
        $user = $userModel->find($userId);